<template>
  <q-page class="q-px-md">
    <BulletinInfo :data="bulletinData" />
  </q-page>
</template>

<script>
import BulletinInfo from 'src/components/bulletin/BulletinInfo.vue'

export default {
    name: 'Bulletin',
    components: {
        BulletinInfo
    },
    data () {
        return {
            bulletinData: [
                { date: '2023/10/10', info: '親愛的用戶，我們的網站將於今晚進行系統升級，屆時將暫停網站的部分功能。預計升級時間為2小時，期間您可能... 會無法登錄或使用部分功能。我們將盡快完成升級，並在升級後恢復正常運行。感謝您的耐心等待和理解！' },
                { date: '2023/10/11', info: '親愛的用戶，我們的網站將於今晚進行系統升級，屆時將暫停網站的部分功能。預計升級時間為2小時，期間您可能... 會無法登錄或使用部分功能。我們將盡快完成升級，並在升級後恢復正常運行。感謝您的耐心等待和理解！' },
                { date: '2023/10/12', info: '親愛的用戶，我們的網站將於今晚進行系統升級，屆時將暫停網站的部分功能。預計升級時間為2小時，期間您可能... 會無法登錄或使用部分功能。我們將盡快完成升級，並在升級後恢復正常運行。感謝您的耐心等待和理解！' },
                { date: '2023/10/13', info: '親愛的用戶，我們的網站將於今晚進行系統升級，屆時將暫停網站的部分功能。預計升級時間為2小時，期間您可能... 會無法登錄或使用部分功能。我們將盡快完成升級，並在升級後恢復正常運行。感謝您的耐心等待和理解！' },
                { date: '2023/10/14', info: '親愛的用戶，我們的網站將於今晚進行系統升級，屆時將暫停網站的部分功能。預計升級時間為2小時，期間您可能... 會無法登錄或使用部分功能。我們將盡快完成升級，並在升級後恢復正常運行。感謝您的耐心等待和理解！' }
            ]
        }
    },
    created () {
    },
    mounted () {
    },
    methods: {
    }
}
</script>
